Tekla Open API Reference for Tekla Structures 2025
GeometryConstants Class
 The Constants class of Geometry3d holds certain constant values that are used internally by the other geometry classes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Geometry3d.GeometryConstants
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class GeometryConstants
<SerializableAttribute>
Public Class GeometryConstants
The GeometryConstants type exposes the following members.
Constructors
Name | Description
GeometryConstants
Initializes a new instance of the GeometryConstants class
Top
Fields
Name | Description
ANGULAR_EPSILON
 The minimum angle (radians) used for checking angular parallelism, perpendicularity, etc. Anything smaller will be considered equivalent to 0.0.
DISTANCE_EPSILON
 The minimum distance used for checking if points, lines, etc. coincide. Anything smaller will be considered equivalent to 0.0.
SCALAR_EPSILON
 The minimum value used for comparing floating point scalar values. Any smaller difference will be considered equivalent to 0.0.
Top
See Also
Reference
Tekla.Structures.Geometry3d Namespace